# Time Series con Pandas

In [32]:
import pandas as pd
import numpy as np

### 1. Dates y Times em Python

La libreria básica para tratar fechas es datetime:

In [2]:
from datetime import datetime
datetime(year = 2024, month = 4, day = 1)

datetime.datetime(2024, 4, 1, 0, 0)

La libreria ``dateutil`` es muy útil para transformar fechas en cualquier formato

In [19]:
# https://dateutil.readthedocs.io/en/stable/parser.html#functions
from dateutil import parser
print(parser.parse("1st of April, 2024"))
print(parser.parse("04/01/2024")) # Primero mes, luego día
print(parser.parse("01/04/2024")) 
print(parser.parse("01/04/2024", dayfirst=True))

2024-04-01 00:00:00
2024-04-01 00:00:00
2024-01-04 00:00:00
2024-04-01 00:00:00

In [9]:
print(parser.parse("1/4/2024"))
print(parser.parse("01-04-2024"))
print(parser.parse("2024-01-04"))

2024-01-04 00:00:00
2024-01-04 00:00:00
2024-01-04 00:00:00

In [17]:
print(parser.parse("4/13/2024"))
print(parser.parse("13/04/2024"))
print(parser.parse("Monday 1st of April, 2024"))

2024-04-13 00:00:00
2024-04-13 00:00:00
2024-04-01 00:00:00

Con el método strftime, puedes mostrar cualquier elemento de la fecha

In [21]:
# https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior
datetime(year = 2024, month = 4, day = 1).strftime('%A')

'Monday'

### 2. Dates and Times in numpy

In [33]:
import numpy as np
date = np.array('2024-04-01', dtype = np.datetime64)
date

array('2024-04-01', dtype='datetime64[D]')

In [34]:
# Dtype np.datetime54 es más exquisito con el formato
np.array('01/04/2024', dtype = np.datetime64)

ValueError: Cannot create a NumPy datetime other than NaT with generic units

Once we have this date formatted, however, we can quickly do vectorized operations on it:

In [26]:
np.arange(12)

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [30]:
# Podemos sumar de forma natural
date + np.arange(12)

array(['2024-04-01', '2024-04-02', '2024-04-03', '2024-04-04',
       '2024-04-05', '2024-04-06', '2024-04-07', '2024-04-08',
       '2024-04-09', '2024-04-10', '2024-04-11', '2024-04-12'],
      dtype='datetime64[D]')

Here is a minute-based datetime:

In [29]:
np.datetime64('2024-04-01 18:30')

numpy.datetime64('2024-04-01T18:30')

Por defecto, utiliza el huso horario de la computadora. 

No obstante, se puede dar el formato que desees

The following table, drawn from the [NumPy datetime64 documentation](http://docs.scipy.org/doc/numpy/reference/arrays.datetime.html), lists the available format codes along with the relative and absolute timespans that they can encode:

|Code    | Meaning     | Time span (relative) | Time span (absolute)   |
|--------|-------------|----------------------|------------------------|
| ``Y``  | Year	       | ± 9.2e18 years       | [9.2e18 BC, 9.2e18 AD] |
| ``M``  | Month       | ± 7.6e17 years       | [7.6e17 BC, 7.6e17 AD] |
| ``W``  | Week	       | ± 1.7e17 years       | [1.7e17 BC, 1.7e17 AD] |
| ``D``  | Day         | ± 2.5e16 years       | [2.5e16 BC, 2.5e16 AD] |
| ``h``  | Hour        | ± 1.0e15 years       | [1.0e15 BC, 1.0e15 AD] |
| ``m``  | Minute      | ± 1.7e13 years       | [1.7e13 BC, 1.7e13 AD] |
| ``s``  | Second      | ± 2.9e12 years       | [ 2.9e9 BC, 2.9e9 AD]  |
| ``ms`` | Millisecond | ± 2.9e9 years        | [ 2.9e6 BC, 2.9e6 AD]  |
| ``us`` | Microsecond | ± 2.9e6 years        | [290301 BC, 294241 AD] |
| ``ns`` | Nanosecond  | ± 292 years          | [ 1678 AD, 2262 AD]    |
| ``ps`` | Picosecond  | ± 106 days           | [ 1969 AD, 1970 AD]    |
| ``fs`` | Femtosecond | ± 2.6 hours          | [ 1969 AD, 1970 AD]    |
| ``as`` | Attosecond  | ± 9.2 seconds        | [ 1969 AD, 1970 AD]    |

### 3. Dates and Times in Pandas

#### Default arguments

In [35]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df

        date  value
0  3/10/2000      2
1  3/11/2000      3
2  3/12/2000      4

In [36]:
df.dtypes

date     object
value     int64
dtype: object

In [37]:
df['date'] = pd.to_datetime(df['date'])
df

        date  value
0 2000-03-10      2
1 2000-03-11      3
2 2000-03-12      4

In [38]:
df.dtypes

date     datetime64[ns]
value             int64
dtype: object

#### Con el día primero

In [39]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

df['date'] = pd.to_datetime(df['date'], dayfirst=True)
df

        date  value
0 2000-10-03      2
1 2000-11-03      3
2 2000-12-03      4

#### Podemos usar el formato que nosotros deseemos

In [40]:
df = pd.DataFrame({'date': ['2016-6-10 20:30:0', 
                            '2016-7-1 19:45:30', 
                            '2013-10-12 4:5:1'],
                   'value': [2, 3, 4]})

df['date'] = pd.to_datetime(df['date'], format="%Y-%m-%d %H:%M:%S")
df

                 date  value
0 2016-06-10 20:30:00      2
1 2016-07-01 19:45:30      3
2 2013-10-12 04:05:01      4

#### Tratamiento de errores

In [41]:
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

df['date'] = pd.to_datetime(df['date'])

ValueError: time data "a/11/2000" doesn't match format "%m/%d/%Y", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [46]:
# ignore: no hacer nada
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

df['date'] = pd.to_datetime(df['date'], errors = 'ignore')
df

C:\Users\jonat\AppData\Local\Temp\ipykernel_26120\1367656756.py:5: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_datetime without passing `errors` and catch exceptions explicitly instead
  df['date'] = pd.to_datetime(df['date'], errors = 'ignore')

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [47]:
df.dtypes

date     object
value     int64
dtype: object

In [45]:
# coerce: imponer la transformación a fechas, sustituyendo inválidas por NaT
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

df['date'] = pd.to_datetime(df['date'], errors = 'coerce')
df

        date  value
0 2000-03-10      2
1        NaT      3
2 2000-03-12      4

In [31]:
df.dtypes

date     datetime64[ns]
value             int64
dtype: object

In [49]:
print(df.loc[0, 'date'])
print(df.loc[1, 'date'])

3/10/2000
a/11/2000

### 4. Assemble a datetime from multiple columns

In [33]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})

df

   year  month  day
0  2015      2    4
1  2016      3    5

In [34]:
df['date'] = pd.to_datetime(df)

In [36]:
df

   year  month  day       date
0  2015      2    4 2015-02-04
1  2016      3    5 2016-03-05

In [37]:
df.dtypes

year              int64
month             int64
day               int64
date     datetime64[ns]
dtype: object

### 5. Obtener año, mes, día...

In [71]:
df = pd.DataFrame({'name': ['Anna', 'Andy', 'Lucas', 'Irene'],
                 'DoB': ['01-01-2010', '04-28-1996', '01-01-2024', '01-04-2010']})

df['DoB'] = pd.to_datetime(df['DoB'])
df

    name        DoB
0   Anna 2010-01-01
1   Andy 1996-04-28
2  Lucas 2024-01-01
3  Irene 2010-01-04

In [72]:
df['year'] = df['DoB'].apply(lambda x: x.year)
df['month'] = df['DoB'].apply(lambda x: x.month)
df['day'] = df['DoB'].apply(lambda x: x.day)
df

    name        DoB  year  month  day
0   Anna 2010-01-01  2010      1    1
1   Andy 1996-04-28  1996      4   28
2  Lucas 2024-01-01  2024      1    1
3  Irene 2010-01-04  2010      1    4

In [73]:
df['year_2'] = df['DoB'].dt.year
df['month_2'] = df['DoB'].dt.month
df['day_2'] = df['DoB'].dt.day
df

    name        DoB  year  month  day  year_2  month_2  day_2
0   Anna 2010-01-01  2010      1    1    2010        1      1
1   Andy 1996-04-28  1996      4   28    1996        4     28
2  Lucas 2024-01-01  2024      1    1    2024        1      1
3  Irene 2010-01-04  2010      1    4    2010        1      4

In [55]:
df.dtypes

name               object
DoB        datetime64[ns]
year                int64
month               int64
day                 int64
year_2              int32
month_2             int32
day_"               int32
day_2               int32
dtype: object

### 6. La semaña del año, años bisiestos

In [74]:
# Cuidado con la semana! Empieza a contar desde el primer lunes del año!
# 2010 vs 2024
df['week_of_year'] = df['DoB'].dt.isocalendar().week
df['day_of_week'] = df['DoB'].dt.dayofweek
df['is_leap_year'] = df['DoB'].dt.is_leap_year
df

,name,DoB,year,month,day,year_2,month_2,day_2,week_of_year,day_of_week,is_leap_year
0,Anna,2010-01-01,2010,1,1,2010,1,1,53,4,False
1,Andy,1996-04-28,1996,4,28,1996,4,28,17,6,True
2,Lucas,2024-01-01,2024,1,1,2024,1,1,1,0,True
3,Irene,2010-01-04,2010,1,4,2010,1,4,1,0,False

In [79]:
dw_mapping={
    0: 'Monday', 
    1: 'Tuesday', 
    2: 'Wednesday', 
    3: 'Thursday', 
    4: 'Friday',
    5: 'Saturday', 
    6: 'Sunday'
} 

dw_mapping_es={
    0: 'Lunes', 
    1: 'Martes', 
    2: 'Miércoles', 
    3: 'Jueves', 
    4: 'Viernes',
    5: 'Sábado', 
    6: 'Domingo'
} 
df['day_of_week_name']=df['DoB'].dt.weekday.map(dw_mapping)
df['day_of_week_name_2']=df['DoB'].dt.strftime('%A')
df['dia_senaba']=df['DoB'].dt.weekday.map(dw_mapping_es)
df

,name,DoB,year,month,day,year_2,month_2,day_2,week_of_year,day_of_week,is_leap_year,day_of_week_name,day_of_week_name_2,dia_senaba
0,Anna,2010-01-01,2010,1,1,2010,1,1,53,4,False,Friday,Friday,Viernes
1,Andy,1996-04-28,1996,4,28,1996,4,28,17,6,True,Sunday,Sunday,Domingo
2,Lucas,2024-01-01,2024,1,1,2024,1,1,1,0,True,Monday,Monday,Lunes
3,Irene,2010-01-04,2010,1,4,2010,1,4,1,0,False,Monday,Monday,Lunes

### 7. Fecha y día actuales

In [80]:
pd.to_datetime('today')

Timestamp('2024-03-31 14:23:09.599122')

In [81]:
datetime.today()

datetime.datetime(2024, 3, 31, 14, 23, 11, 654514)

In [82]:
today = pd.to_datetime('today')
df['age'] = today.year - df['DoB'].dt.year

df

,name,DoB,year,month,day,year_2,month_2,day_2,week_of_year,day_of_week,is_leap_year,day_of_week_name,day_of_week_name_2,dia_senaba,age
0,Anna,2010-01-01,2010,1,1,2010,1,1,53,4,False,Friday,Friday,Viernes,14
1,Andy,1996-04-28,1996,4,28,1996,4,28,17,6,True,Sunday,Sunday,Domingo,28
2,Lucas,2024-01-01,2024,1,1,2024,1,1,1,0,True,Monday,Monday,Lunes,0
3,Irene,2010-01-04,2010,1,4,2010,1,4,1,0,False,Monday,Monday,Lunes,14

### 8. pd.read_csv: leer en formato fechas

In [83]:
df = pd.read_csv('data/city_sales.csv', parse_dates = ['date'])
df

                       date  num       city
0       2015-01-01 09:00:00    4     London
1       2015-01-01 09:01:00    4     London
2       2015-01-01 09:02:00    3     London
3       2015-01-01 09:03:00    3     London
4       2015-01-01 09:04:00    3     London
...                     ...  ...        ...
1795139 2019-01-31 15:56:00    3  Cambridge
1795140 2019-01-31 15:57:00    3  Cambridge
1795141 2019-01-31 15:58:00    3  Cambridge
1795142 2019-01-31 15:59:00    3  Cambridge
1795143 2019-01-31 16:00:00    2  Cambridge

[1795144 rows x 3 columns]

In [84]:
df.describe(include='all')

                                 date           num     city
count                         1795144  1.795144e+06  1795144
unique                            NaN           NaN        4
top                               NaN           NaN   London
freq                              NaN           NaN   448786
mean    2017-01-16 10:05:27.579737344  2.801503e+00      NaN
min               2015-01-01 09:00:00  1.000000e+00      NaN
25%               2016-01-08 12:30:00  2.000000e+00      NaN
50%               2017-01-17 00:30:00  3.000000e+00      NaN
75%               2018-01-24 12:30:00  3.000000e+00      NaN
max               2019-01-31 16:00:00  4.000000e+00      NaN
std                               NaN  8.714650e-01      NaN

In [60]:
df.dtypes

date    datetime64[ns]
num              int64
city            object
dtype: object

### Cuando se trata de fechas, si es común utilizarlas como índices para mejorar la performance

In [61]:
df = pd.read_csv('data/city_sales.csv', parse_dates = ['date'])
df.set_index(['date'], inplace=True)
df.head()

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London

In [88]:
df = pd.read_csv('data/city_sales.csv', parse_dates = ['date'], index_col = 'date')
df.head()

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London

In [63]:
# Tenemos un DateTimeIndex
df.index

DatetimeIndex(['2015-01-01 09:00:00', '2015-01-01 09:01:00',
               '2015-01-01 09:02:00', '2015-01-01 09:03:00',
               '2015-01-01 09:04:00', '2015-01-01 09:05:00',
               '2015-01-01 09:06:00', '2015-01-01 09:07:00',
               '2015-01-01 09:08:00', '2015-01-01 09:09:00',
               ...
               '2019-01-31 15:51:00', '2019-01-31 15:52:00',
               '2019-01-31 15:53:00', '2019-01-31 15:54:00',
               '2019-01-31 15:55:00', '2019-01-31 15:56:00',
               '2019-01-31 15:57:00', '2019-01-31 15:58:00',
               '2019-01-31 15:59:00', '2019-01-31 16:00:00'],
              dtype='datetime64[ns]', name='date', length=1795144, freq=None)

### pd.to_datetime es flexible a la hora de parsear los formatos

In [85]:
dates = pd.to_datetime([datetime(2015, 7, 3), '4th of July, 2015',
                       '2015-Jul-6', '07-07-2015', '20150708'])
dates

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-06', '2015-07-07',
               '2015-07-08'],
              dtype='datetime64[ns]', freq=None)

### 9. Usar fechas como índices tiene sus ventajas a la hora de realizar selecciones

In [89]:
df = pd.read_csv('data/city_sales.csv', parse_dates = ['date'], index_col = 'date')
# Seleccion más sencilla
df.loc['2018']

                     num       city
date
2018-01-01 09:00:00    2     London
2018-01-01 09:01:00    1     London
2018-01-01 09:02:00    3     London
2018-01-01 09:03:00    3     London
2018-01-01 09:04:00    3     London
...                  ...        ...
2018-12-31 15:56:00    4  Cambridge
2018-12-31 15:57:00    2  Cambridge
2018-12-31 15:58:00    3  Cambridge
2018-12-31 15:59:00    3  Cambridge
2018-12-31 16:00:00    2  Cambridge

[439524 rows x 2 columns]

In [94]:
# Usando máscaras es algo más engorroso
df[df.index.year == 2018]

                     num       city
date
2018-01-01 09:00:00    2     London
2018-01-01 09:01:00    1     London
2018-01-01 09:02:00    3     London
2018-01-01 09:03:00    3     London
2018-01-01 09:04:00    3     London
...                  ...        ...
2018-12-31 15:56:00    4  Cambridge
2018-12-31 15:57:00    2  Cambridge
2018-12-31 15:58:00    3  Cambridge
2018-12-31 15:59:00    3  Cambridge
2018-12-31 16:00:00    2  Cambridge

[439524 rows x 2 columns]

In [91]:
df.loc['2018-01']

                     num       city
date
2018-01-01 09:00:00    2     London
2018-01-01 09:01:00    1     London
2018-01-01 09:02:00    3     London
2018-01-01 09:03:00    3     London
2018-01-01 09:04:00    3     London
...                  ...        ...
2018-01-31 15:56:00    2  Cambridge
2018-01-31 15:57:00    3  Cambridge
2018-01-31 15:58:00    3  Cambridge
2018-01-31 15:59:00    1  Cambridge
2018-01-31 16:00:00    1  Cambridge

[38732 rows x 2 columns]

In [93]:
df.loc['2018-5-1'].head()

                     num    city
date
2018-05-01 09:00:00    1  London
2018-05-01 09:01:00    4  London
2018-05-01 09:02:00    3  London
2018-05-01 09:03:00    2  London
2018-05-01 09:04:00    3  London

In [96]:
df.loc['2018'].groupby('city').sum()

              num
city
Cambridge  308428
Durham     307965
London     307431
Oxford     307366

### 11. Seleccionar fechas entre dos valores

In [108]:
# Hay que asegurarse de que el índice está ordenado
df.sort_index().loc['2016':'2018']
# Da error!
#df.loc['2016':'2018']

                     num       city
date
2016-01-01 09:00:00    3  Cambridge
2016-01-01 09:00:00    4     London
2016-01-01 09:00:00    3     Durham
2016-01-01 09:00:00    3     Oxford
2016-01-01 09:01:00    2     Oxford
...                  ...        ...
2018-12-31 15:59:00    2     Oxford
2018-12-31 16:00:00    2     Durham
2018-12-31 16:00:00    3     Oxford
2018-12-31 16:00:00    2  Cambridge
2018-12-31 16:00:00    3     London

[1316888 rows x 2 columns]

In [107]:
df = df.sort_index()

In [109]:
df.loc['2018-5-2 10:30' : '2018-5-2 10:45' ]

                     num       city
date
2018-05-02 10:30:00    3     London
2018-05-02 10:30:00    3     Oxford
2018-05-02 10:30:00    2     Durham
2018-05-02 10:30:00    3  Cambridge
2018-05-02 10:31:00    2     Durham
...                  ...        ...
2018-05-02 10:44:00    3  Cambridge
2018-05-02 10:45:00    4     London
2018-05-02 10:45:00    3     Durham
2018-05-02 10:45:00    3     Oxford
2018-05-02 10:45:00    1  Cambridge

[64 rows x 2 columns]

In [110]:
df.between_time('10:30','10:45')

                     num       city
date
2015-01-01 10:30:00    4     London
2015-01-01 10:30:00    4  Cambridge
2015-01-01 10:30:00    4     Oxford
2015-01-01 10:30:00    2     Durham
2015-01-01 10:31:00    3     London
...                  ...        ...
2019-01-31 10:44:00    2     London
2019-01-31 10:45:00    4     London
2019-01-31 10:45:00    4  Cambridge
2019-01-31 10:45:00    3     Oxford
2019-01-31 10:45:00    2     Durham

[68224 rows x 2 columns]

### 12. Operaaciones con Fechas

In [112]:
df = pd.DataFrame({'name': ['Tom', 'Andy', 'Lucas'],
                 'DoB': ['08-05-1997', '04-28-1996', '12-16-1995']})

df['DoB'] = pd.to_datetime(df['DoB'])
df

    name        DoB
0    Tom 1997-08-05
1   Andy 1996-04-28
2  Lucas 1995-12-16

In [113]:
from pandas.tseries.offsets import DateOffset, BDay
# Sumar o restar 
print(df['DoB'] + DateOffset(days = 5))
print(df['DoB'] + DateOffset(days = -5))
print(df['DoB'] + DateOffset(months = 5))

0   1997-08-10
1   1996-05-03
2   1995-12-21
Name: DoB, dtype: datetime64[ns]
0   1997-07-31
1   1996-04-23
2   1995-12-11
Name: DoB, dtype: datetime64[ns]
0   1998-01-05
1   1996-09-28
2   1996-05-16
Name: DoB, dtype: datetime64[ns]

In [114]:
# Otra forma
from datetime import timedelta
print(df['DoB'] + timedelta(days = 5))
print(df['DoB'] + timedelta(days = -5))
print(df['DoB'] + timedelta(months = 5))

0   1997-08-10
1   1996-05-03
2   1995-12-21
Name: DoB, dtype: datetime64[ns]
0   1997-07-31
1   1996-04-23
2   1995-12-11
Name: DoB, dtype: datetime64[ns]

TypeError: 'months' is an invalid keyword argument for __new__()

In [117]:
# BusinessDays: excluir sábados y domingos
BDay(10)

In [116]:
print(df['DoB'])
print(df['DoB'] + BDay(10))

0   1997-08-05
1   1996-04-28
2   1995-12-16
Name: DoB, dtype: datetime64[ns]
0   1997-08-19
1   1996-05-10
2   1995-12-29
Name: DoB, dtype: datetime64[ns]

### 13. Regular sequences: ``pd.date_range()``

``pd.date_range()``  es similar al ya conocido ``range`` o ``np.arange``

Utiliza argumentos como:
* fecha inicial
* fecha final
* periodos
* frecuencia

In [119]:
# Fecha final se incluye!!
pd.date_range('2015-07-03', '2015-07-10')

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-05', '2015-07-06',
               '2015-07-07', '2015-07-08', '2015-07-09', '2015-07-10'],
              dtype='datetime64[ns]', freq='D')

Usando el número de periodos total

In [94]:
pd.date_range('2015-07-03', periods = 8)

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-05', '2015-07-06',
               '2015-07-07', '2015-07-08', '2015-07-09', '2015-07-10'],
              dtype='datetime64[ns]', freq='D')

Frecuencia: diaria, mensual, horas, segundos...

In [101]:
pd.date_range('2015-01-01', periods = 12, freq='M')

DatetimeIndex(['2015-01-31', '2015-02-28', '2015-03-31', '2015-04-30',
               '2015-05-31', '2015-06-30', '2015-07-31', '2015-08-31',
               '2015-09-30', '2015-10-31', '2015-11-30', '2015-12-31'],
              dtype='datetime64[ns]', freq='M')

In [121]:
pd.date_range('2015-01-01', periods = 12, freq='s')

DatetimeIndex(['2015-01-01 00:00:00', '2015-01-01 00:00:01',
               '2015-01-01 00:00:02', '2015-01-01 00:00:03',
               '2015-01-01 00:00:04', '2015-01-01 00:00:05',
               '2015-01-01 00:00:06', '2015-01-01 00:00:07',
               '2015-01-01 00:00:08', '2015-01-01 00:00:09',
               '2015-01-01 00:00:10', '2015-01-01 00:00:11'],
              dtype='datetime64[ns]', freq='s')

In [122]:
pd.date_range('2015-01-01', periods = 12, freq='h')

DatetimeIndex(['2015-01-01 00:00:00', '2015-01-01 01:00:00',
               '2015-01-01 02:00:00', '2015-01-01 03:00:00',
               '2015-01-01 04:00:00', '2015-01-01 05:00:00',
               '2015-01-01 06:00:00', '2015-01-01 07:00:00',
               '2015-01-01 08:00:00', '2015-01-01 09:00:00',
               '2015-01-01 10:00:00', '2015-01-01 11:00:00'],
              dtype='datetime64[ns]', freq='h')

| Code   | Description         | Code   | Description          |
|--------|---------------------|--------|----------------------|
| ``D``  | Calendar day        | ``B``  | Business day         |
| ``W``  | Weekly              |        |                      |
| ``ME``  | Month end           | ``BME`` | Business month end   |
| ``QE``  | Quarter end         | ``BQE`` | Business quarter end |
| ``YE``  | Year end            | ``BYE`` | Business year end    |
| ``h``  | Hours               | ``bh`` | Business hours       |
| ``min``  | Minutes             |        |                      |
| ``s``  | Seconds             |        |                      |
| ``ms``  | Milliseonds         |        |                      |
| ``us``  | Microseconds        |        |                      |
| ``ns``  | nanoseconds         |        |                      |

In [140]:
pd.date_range('2024-01-01', periods = 12, freq='ME')

DatetimeIndex(['2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30',
               '2024-05-31', '2024-06-30', '2024-07-31', '2024-08-31',
               '2024-09-30', '2024-10-31', '2024-11-30', '2024-12-31'],
              dtype='datetime64[ns]', freq='ME')